{

	"Core": {

		"Core": {
			"deps": ["Core"],
			"desc": "The core of MooTools, contains all the base functions and the Native implementations. Required by all the other scripts."
		}

	},

	"Native": {
		
		"Object": {
			"deps": ["Core"],
			"desc": "Contains Object generics / prototypes."
		},

		"Array": {
			"deps": ["Core"],
			"desc": "Contains Array Prototypes like each, contains, and erase."
		},

		"Function": {
			"deps": ["Core"],
			"desc": "Contains Function Prototypes like create, bind, pass, and delay."
		},

		"Number": {
			"deps": ["Core"],
			"desc": "Contains Number Prototypes like limit, round, times, and ceil."
		},

		"String": {
			"deps": ["Core"],
			"desc": "Contains String Prototypes like camelCase, capitalize, test, and toInt."
		}

	},

	"Class": {

		"Class": {
			"deps": ["Mixins"],
			"desc": "Contains the Class Function for easily creating, extending, and implementing reusable Classes."
		},

		"Mixins": {
			"deps": ["Array", "Function", "Number", "String", "Object"],
			"desc": "Contains Utility Classes that can be implemented into your own Classes to ease the execution of many common tasks."
		}

	}, 
	
	"Browser": {

		"Browser": {
			"deps": ["Mixins"],
			"desc": "Contains Window, Document, and the Browser Object. This file requires MooTools to run in a Browser."
		},
		
		"Event": {
			"deps": ["Element"],
			"desc": "Contains the Event Class, transforms the event object, makes it CrossBrowser."
		}

	},

	"Element": {

		"Element": {
			"deps": ["Browser", "Mixins"],
			"desc": "Contains methods to work with HTML Elements."
		},

		"Element.Event": {
			"deps": ["Event"],
			"desc": "Contains Element methods for dealing with events. This file also includes mouseenter and mouseleave custom Element Events."
		},

		"Element.Style": {
			"deps": ["Element"],
			"desc": "Contains methods for interacting with the styles of Elements in a fashionable way."
		},

		"Element.Dimensions": {
			"deps": ["Element"],
			"desc": "Contains methods to work with size, scroll, or positioning of Elements and the window object."
		}

	},


	"Utilities": {

		"Slick": {
			"deps": [],
			"desc": "The new superfast css selector engine. Adds advanced CSS Querying capabilities for targeting elements."
		},

		"DomReady": {
			"deps": ["Element.Event"],
			"desc": "Contains the custom event domready."
		},

		"JSON": {
			"deps": ["Array", "String", "Function", "Number", "Object"],
			"desc": "JSON encoder and decoder."
		}

	},

	"Fx": {

		"Fx": {
			"deps": ["Mixins"],
			"desc": "Contains the basic animation logic to be extended by all other Fx Classes."
		},

		"Fx.CSS": {
			"deps": ["Fx", "Element.Style"],
			"desc": "Contains the CSS animation logic. Used by Fx.Tween, Fx.Morph, Fx.Elements."
		},

		"Fx.Tween": {
			"deps": ["Fx.CSS"],
			"desc": "Formerly Fx.Style, effect to transition any CSS property for an element."
		},

		"Fx.Morph": {
			"deps": ["Fx.CSS"],
			"desc": "Formerly Fx.Styles, effect to transition any number of CSS properties for an element using an object of rules, or CSS based selector rules."
		},

		"Fx.Transitions": {
			"deps": ["Fx"],
			"desc": "Contains a set of advanced transitions to be used with any of the Fx Classes."
		}

	},

	"Request": {

		"Request": {
			"deps": ["Mixins", "Element"],
			"desc": "Powerful all purpose Request Class. Uses XMLHTTPRequest."
		},

		"Request.HTML": {
			"deps": ["Request"],
			"desc": "Extends the basic Request Class with additional methods for interacting with HTML responses."
		},

		"Request.JSON": {
			"deps": ["Request", "JSON"],
			"desc": "Extends the basic Request Class with additional methods for sending and receiving JSON data."
		}

	},
	
	"Compatibility": {

		"1.2": {
			"deps": ["Class"],
			"desc": "Provides full compatibility with MooTools version 1.2."
		}

	}

}